"""
Напишите функцию которая будет принимать список чисел и выводить на экран надпись "сегодня x градусов" столько раз
сколько значений в списке.
"""

def print_degree(nums): [print(f'сегодня {num} градусов') for num in nums]