"""
Создайте функцию которая принимает на вход 3 именованных параметра, выведите на печать значения этих параметров,
но только в том случае если они не равны None.
"""
def f(x,y,z):
	if x != None or y != None or z != none: print(x, y, z)
