from fuzzywuzzy import fuzz
per = fuzz.token_sort_ratio
def schedule():
    shed = {
        'Понедельник':{'08:00 - 08:55':'Йога', '11:00 - 11:55':'Фитнесс', '19:00 - 19:40':'Бассейн'},
        'Вторник'    :{'08:00 - 08:55':'Танцы', '09:00 - 09:40':'Бассейн', '10:00 - 10:45':'Зал', '12:00 - 12:55':'Фитнесс', '18:00 - 18:40':'Бассейн'},
        'Среда'      :{'08:00 - 08:55':'Йога', '09:00 - 09:45':'Аэробика'},
        'Четверг'    :{'08:00 - 08:45':'Зал', '09:00 - 09:40':'Бассейн', '18:00 - 18:45':'Аэробика'},
        'Пятница'    :{'08:00 - 08:55':'Йога', '09:00 - 09:40':'Бассейн', '11:00 - 11:45':'Зал'},
        'Суббота'    :{'10:00 - 10:45':'Зал', '11:00 - 11:40':'Бассейн'},
        'Воскресенье':{'10:00 - 10:40':'Бассейн', '11:00 - 11:55':'Йога', '15:00 - 15:45':'Зал'}
    }
    return '\n'.join([' : '.join(i) for i in shed[input('Выберите день недели: ')].items()])
def couch():
    couches = {
        'Йога':['Дегтярёва Диана','+791234567890','dyagter.diana@yandex.ru'],
        'Фитнесс':['Балашова Арина','+792345678901','balashov.arina@yandex.ru'],
        'Бассейн':['Рябчич Ольга','+793456789012','ryabchich.olga@yandex.ru'],
        'Танцы':['Балашова Арина','+792345678901','balashov.arina@yandex.ru'],
        'Зал':['Медяк Свтелана','+793456789012','medyak.svetlana@yandex.ru'],
        'Аэробика':['Бердникова Ирина','+794567890123','berdnikova.irina@yandex.ru']
    }
    numtovalue = {
        1:'Йога',
        2:'Фитнесс',
        3:'Бассейн',
        4:'Танцы',
        5:'Зал',
        6:'Аэробика'
    }
    try: return '\n'.join(couches[numtovalue[int(input('{}\nВыберите дисциплину которую ведет ваш тренер(1-6): '.format('\n'.join([f'{str(x+1)}. {str(list(couches.items())[x][0])}' for x in range(len(couches.items()))]))))]])
    except:
        print('Введен неправильный номер, попробуйте еще раз')
        return couch()
def payment():
    price = {
        'Йога':350,
        'Фитнесс':400,
        'Бассейн':450,
        'Танцы':425,
        'Зал':375,
        'Аэробика':425
    }
    sum = 0
    for i in (''.join(([(lambda x: x if x.isalnum() or x == ':' else ' ')(x) for x in input('Введите название дисциплины и количество посещаемых раз(name:count): ')])).split()):
        for key in price:
            if per(key,i.split(':')[0])>90:
                sum += price[key] * int(i.split(':')[1])
    return f'Ваша сумма к оплате: {sum} рублей'
def call():
	num = input('Укажите свое имя и номер телефона: ')
	if (len(num.split()[1]) != 11 and num.split()[1][:3]!='+79') or (len(num.split()[1]) != 12 and num.split()[1][:2]!='89'):
		print('Введён неверный номер телефона, попробуйте еще раз')
		return call()
	else: return 'Заявка принята, ожидайте звонок'

def location():
    locations = {
        'Москва':'Адрес: Москва, пр. Андропова, д. 22',
        'Пермь':'Адрес: Пермь, бульвар Гагарина, д. 32 ',
        'Белгород':'Адрес: Белгород, ул. Костюкова, д. 39',
        'Волгоград':'Адрес: Волгоград, ул. Землячки, д. 110б '
    }
    a = input('Доступные города:\n{}\nВведите город: '.format('\n'.join([x for x in locations])))
    for key in locations:
        if per(key,a)>80: return locations[key]
if __name__ == '__main__':
    d = {'Расписание':schedule,'Тренер':couch,'Плата':payment,'Звонок':call,'Где':location}
    def main(req):
        for key in d:
            if per(key,req) >= 40: return d[key]()
    while True: print(main(input('Введите ваш запрос: ')))
