"""
Создайте функцию которая принимает на вход 3 именованных параметра, выведите на печать значения этих параметров,
но только в том случае если они не равны None.
"""
def f(x,y,z): None not in (x,y,z) and print(x,y,z)